# Taps
tap 'homebrew/cask'
tap 'homebrew/services'

# Essentials
brew 'antigen'
brew 'logrotate'
brew 'gnupg'
brew 'm-cli'
brew 'pinentry-mac'
brew 'tmux'
brew 'wget'
brew 'zsh'

# Development
brew 'awscli'
brew 'composer'
brew 'git'
brew 'go'
brew 'hub'
brew 'yarn'

# Web server
brew 'certbot'
brew 'dnsmasq'
brew 'mysql@5.7'
brew 'nginx'
brew 'php'
brew 'phpmyadmin'
brew 'redis'

# Home theater
brew 'couchpotatoserver'
cask 'plex-media-server'
brew 'lftp'

# Apps
cask '1password'
cask 'alfred'
cask 'atom'
cask 'bartender'
cask 'bettertouchtool'
cask 'carbon-copy-cloner'
cask 'coderunner'
cask 'daisydisk'
cask 'dropbox'
cask 'evernote'
cask 'firefox'
cask 'flux'
cask 'google-chrome'
cask 'hazel'
cask 'kaleidoscope'
cask 'keybase'
cask 'istat-menus'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'sequel-pro'
cask 'spotify'
cask 'steam'
cask 'transmit'
cask 'vagrant'
cask 'vlc'
cask 'virtualbox'

# Drivers
cask 'homebrew/cask-drivers/apple-hewlett-packard-printer-drivers'
cask 'homebrew/cask-drivers/canon-eos-utility'
cask 'homebrew/cask-drivers/logitech-unifying'
cask 'homebrew/cask-drivers/sony-ps4-remote-play'
cask 'homebrew/cask-drivers/wacom-tablet'
cask 'homebrew/cask-drivers/yubico-yubikey-piv-manager'
