# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/services'

# Essentials
brew 'antigen'
brew 'logrotate'
brew 'gnupg'
brew 'm-cli'
brew 'pinentry-mac'
brew 'tmux'
brew 'tmuxinator'
brew 'wget'
brew 'zsh'

# Development
brew 'awscli'
brew 'composer'
brew 'fnm'
brew 'git'
brew 'go'
brew 'hub'
brew 'yarn'

# Web server
brew 'certbot'
brew 'dnsmasq'
brew 'mysql@5.7'
brew 'nginx'
brew 'php'
brew 'phpmyadmin'
brew 'redis'

# Home theater
brew 'couchpotatoserver'
cask 'plex-media-server'
brew 'lftp'

# Apps
cask '1password'
cask 'a-better-finder-rename'
cask 'alfred'
cask 'atom'
cask 'authy'
cask 'bartender'
cask 'bettertouchtool'
cask 'bitwarden'
cask 'carbon-copy-cloner'
cask 'coderunner'
cask 'daisydisk'
cask 'dash'
cask 'db-browser-for-sqlite'
cask 'discord'
cask 'dropbox'
cask 'evernote'
cask 'firefox'
cask 'flux'
cask 'font-menlo-for-powerline'
cask 'fontbase'
cask 'google-chrome'
cask 'hazel'
cask 'insomnia'
cask 'istat-menus'
cask 'jetbrains-toolbox'
cask 'kaleidoscope'
cask 'keybase'
cask 'notion'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'sequel-pro'
cask 'sketch'
cask 'spotify'
cask 'steam'
cask 'transmit'
cask 'vagrant'
cask 'vlc'
cask 'virtualbox'

# Drivers
cask 'apple-hewlett-packard-printer-drivers'
cask 'canon-eos-utility'
cask 'logitech-unifying'
cask 'wacom-tablet'
cask 'yubico-yubikey-piv-manager'
